5ime/ESP32CamPlus/app_httpd.cpp
// ==== 新增：闪光灯 HTTP 接口 ====
static void flash_burst(uint8_t level, uint16_t interval_ms, uint8_t repeat) {
    if (repeat == 0 || interval_ms == 0) {
        return;
    }
    const uint8_t previous = app_get_flash_duty();
    for (uint8_t i = 0; i < repeat; ++i) {
        app_set_flash_duty(level);
        vTaskDelay(interval_ms / portTICK_PERIOD_MS);
        app_set_flash_duty(0);
        if (i + 1 < repeat) {
            vTaskDelay(interval_ms / portTICK_PERIOD_MS);
        }
    }
    app_set_flash_duty(previous);
}

static esp_err_t flash_handler(httpd_req_t *req) {
    char query[64];
    bool updated = false;
    bool enable = false;
    bool enable_defined = false;
    uint8_t pulse_count = 0;
    uint16_t pulse_interval = 0;
    int target_level = -1;
    auto clamp = [](int value, int min_value, int max_value) {
        return std::max(min_value, std::min(value, max_value));
    };
    auto parse_bool = [](const char *text) {
        return (strcmp(text, "1") == 0) || (strcasecmp(text, "true") == 0) || (strcasecmp(text, "on") == 0);
    };

    if (httpd_req_get_url_query_str(req, query, sizeof(query)) == ESP_OK) {
        char param[16];
        if (httpd_query_key_value(query, "enable", param, sizeof(param)) == ESP_OK) {
            enable = parse_bool(param);
            enable_defined = true;
            updated = true;
        }
        if (httpd_query_key_value(query, "level", param, sizeof(param)) == ESP_OK) {
            target_level = clamp(atoi(param), 0, 255);
            updated = true;
        }
        if (httpd_query_key_value(query, "interval", param, sizeof(param)) == ESP_OK) {
            pulse_interval = static_cast<uint16_t>(clamp(atoi(param), 0, 5000));
            updated = true;
        }
        if (httpd_query_key_value(query, "count", param, sizeof(param)) == ESP_OK) {
            pulse_count = static_cast<uint8_t>(clamp(atoi(param), 0, 20));
            updated = true;
        }
    }

    if (!enable_defined) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "请提供 enable=0/1");
        return ESP_OK;
    }

    if (!enable) {
        app_set_flash_duty(0);
        pulse_count = 0;
    } else if (pulse_count == 0 || pulse_interval == 0) {
        if (target_level < 0) {
            target_level = app_get_flash_duty();
        }
        app_set_flash_duty(static_cast<uint8_t>(target_level));
    } else {
        if (target_level < 0) {
            target_level = 255;
        }
        flash_burst(static_cast<uint8_t>(target_level), pulse_interval, pulse_count);
    }

    char resp[80];
    snprintf(resp, sizeof(resp), "{\"enable\":%u,\"level\":%u,\"interval\":%u,\"count\":%u}",
             enable ? 1 : 0,
             app_get_flash_duty(),
             pulse_interval,
             pulse_count);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, resp);
    Serial.printf("[信息] Web 闪光灯 enable=%u level=%u interval=%u count=%u\n",
                  enable ? 1 : 0,
                  app_get_flash_duty(),
                  pulse_interval,
                  pulse_count);
    return ESP_OK;
}

void startCameraServer() {
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;

    httpd_uri_t index_uri = {"/", HTTP_GET, index_handler, NULL};
    httpd_uri_t status_uri = {"/status", HTTP_GET, status_handler, NULL};
    httpd_uri_t cmd_uri = {"/control", HTTP_GET, cmd_handler, NULL};
    httpd_uri_t capture_uri = {"/capture", HTTP_GET, capture_handler, NULL};
    httpd_uri_t stream_uri = {"/stream", HTTP_GET, stream_handler, NULL};
    httpd_uri_t bmp_uri = {"/bmp", HTTP_GET, bmp_handler, NULL};
    httpd_uri_t xclk_uri = {"/xclk", HTTP_GET, xclk_handler, NULL};
    httpd_uri_t reg_uri = {"/reg", HTTP_GET, reg_handler, NULL};
    httpd_uri_t greg_uri = {"/greg", HTTP_GET, greg_handler, NULL};
    httpd_uri_t pll_uri = {"/pll", HTTP_GET, pll_handler, NULL};
    httpd_uri_t win_uri = {"/resolution", HTTP_GET, win_handler, NULL};
    httpd_uri_t flash_uri = {"/flash", HTTP_GET, flash_handler, NULL};

    ra_filter_init(&ra_filter, 20);

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "fr");
    recognizer.set_ids_from_flash();
#endif

    log_i("Starting web server on port: '%d'", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
        httpd_register_uri_handler(camera_httpd, &bmp_uri);
        httpd_register_uri_handler(camera_httpd, &xclk_uri);
        httpd_register_uri_handler(camera_httpd, &reg_uri);
        httpd_register_uri_handler(camera_httpd, &greg_uri);
        httpd_register_uri_handler(camera_httpd, &pll_uri);
        httpd_register_uri_handler(camera_httpd, &win_uri);
        httpd_register_uri_handler(camera_httpd, &flash_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    log_i("Starting stream server on port: '%d'", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}

void setupLedFlash(int pin) {
#if CONFIG_LED_ILLUMINATOR_ENABLED
    ledcSetup(LED_LEDC_CHANNEL, 5000, 8);
    ledcAttachPin(pin, LED_LEDC_CHANNEL);
#else
    log_i("LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0");
#endif
}